// var map = L.map("map").setView([47.9135779, 106.891201], 17);
// var gl = L.mapboxGL({
//   style:
//     "https://api.maptiler.com/maps/6afd3992-cc29-48c7-b0cd-8cb2bc6826f9/style.json?key=ivor5C9n3yQrz3CjJORd",
// }).addTo(map);
// const markerIcon = L.icon({
//   iconUrl: `https://api.geoapify.com/v1/icon?size=xx-large&type=awesome&color=%2315886A&icon=map-marker-alt&apiKey=${`279a1906fe04474cab20406de93c2d11`}`,
//   iconSize: [31, 46], // size of the icon
//   iconAnchor: [15.5, 42], // point of the icon which will correspond to marker's location
//   popupAnchor: [0, -45], // point from which the popup should open relative to the iconAnchor
// });

// function initMap() {
//   var locations = [
//     // ['UBH Center', 47.9174393, 106.9218193, '94111192'],
//     // ['Ундрам Од Нотариат', 47.9223606, 106.8697753, '99033617'],
//     // ['11-р хороолол СБД-ийн ЗДТГын хажууд', 47.926705, 106.930293, '99083828'],
//     ["Гранд Плаза", 47.9135779, 13.891201, "75111133"],
//     // ['25-р Эмийн Сан (Нотариат)', 47.914366, 106.879735, '99192045'],
//     // ['Төв номын сан (нотариат)', 47.914061, 106.915090, '99033617'],
//     // ['Цэцээ гүн (Нотариат)', 47.922294, 106.915674, '99082652'],
//     // ['19-ийн үйлчилгээний төв 10р байр', 47.901784, 106.900909, '91913705'],
//     // ['32-н буудал Төрийн банктай байр', 47.911599, 106.832922, '99008529'],
//     // ['City Tower', 47.919267, 106.920730, '89113425'],
//     // ['БГД 2-р хороо', 47.914275, 106.886171, '99135992'],
//     // ['Эрдэнэт', 49.0564917, 104.0160386, '9900-8675'],
//     // ['10-р хороолол EFES дэлгүүрийн хажууд', 47.914324, 106.8729699, '90092611'],
//     // ['Бөхийн өргөө Golden pen бичиг хэрэг дэлгүүрийн зүүн талд', 47.9183005, 106.936134, '99833873'],
//     // ['Сүхбаатар дүүрэг, 8-р хороо, СТӨргөө Г корпус 1 давхар 12 тоот', 47.9195764, 106.9171132, '99105900'],
//     // ['Дархан', 49.4707087, 105.9615297, '99770744'],
//     // ['Өмнөговь Ханбогд сум Иргэдийн хөгжлийн төв 1 давхар', 43.1967623, 107.1994426, '88100927'],
//     // ['Өмнөговь Даланзадгад сум Royal center 202тоот', 43.5789658, 104.4196217, '99436604'],
//     // ['Увс Улаангом, 3р баг, Халиун -Бургаа-н дэлгүүр', 49.9903557, 92.0620124, '99455959'],
//     // ['Сүхбаатар Баруун урт, 7-р баг Одкон хотхон "Цахим Баавгай" ХХК', 46.6756472, 113.2795101, '91012822'],
//     // ['Хөвсгөл Мөрөн, 5-р баг, Цагаан-Уул зах', 49.6343025, 100.1570713, '99999538'],
//     // ['Завхан', 47.7337814, 96.8433988, '99106621'],
//     // ['Булган', 48.2969521, 103.4335435, '95839407'],
//     // ['Өвөрхангай', 46.2602463, 102.7818653, '88232003'],
//   ];
//   for (var i in locations) {
//     const zooMarker = L.marker([locations[i][1], locations[i][2]], {
//       icon: markerIcon,
//     })
//       .bindPopup(
//         '<h5 class="trigger"> ' +
//           locations[i][0] +
//           "<br/>  <small> Утас: " +
//           locations[i][3] +
//           "</small></h5>"
//       )
//       .addTo(map);
//   }
// }
// initMap();

// fetch("geree.json")
//   .then((response) => response.json())
//   .then((data) => {
//     {
//       for (var key in data) {
//         var html = data[key]
//           .map(function (item) {
//             phone_number_html =
//               item.phone_number != ""
//                 ? item.phone_number
//                     .map(function (number) {
//                       return `<h6 class="font-weight-normal mb-3"><img src="/svg/icons/phone.png" style="height: 16px; width:16px;"> ${number}</h6>`;
//                     })
//                     .join("")
//                 : "";
//             time_table_html =
//               item.time_table != ""
//                 ? `<h6 class="font-weight-normal"><svg version="1.1" id="Capa_1"
//                                 xmlns="http://www.w3.org/2000/svg"
//                                 xmlns:xlink="http://www.w3.org/1999/xlink" width="20px"
//                                 height="20px" viewBox="0 0 477.867 477.867"
//                                 style="enable-background:new 0 0 477.867 477.867;"
//                                 xml:space="preserve">
//                                 <g>
//                                     <g>
//                                         <path
//                                             d="M238.933,0C106.974,0,0,106.974,0,238.933s106.974,238.933,238.933,238.933s238.933-106.974,238.933-238.933 C477.726,107.033,370.834,0.141,238.933,0z M238.933,443.733c-113.108,0-204.8-91.692-204.8-204.8s91.692-204.8,204.8-204.8 s204.8,91.692,204.8,204.8C443.611,351.991,351.991,443.611,238.933,443.733z"
//                                             fill="#15886A" />
//                                     </g>
//                                     <g>
//                                         <path
//                                             d="M238.933,85.333c-9.426,0-17.067,7.641-17.067,17.067v119.467H102.4c-9.426,0-17.067,7.641-17.067,17.067 S92.974,256,102.4,256h136.533c9.426,0,17.067-7.641,17.067-17.067V102.4C256,92.974,248.359,85.333,238.933,85.333z" />
//                                     </g>
//                                                         </svg> ${item.time_table} </h6>`
//                 : "";
//             return `
//             <div>
//                 <h6 class="font-weight-bold"> ${item.name}</h6>
//                 <div>
//                     <small class="text-gray-600">${item.description}</small>
//                     <br>
//                     <small class="text-gray-600">${item.branch}</small>
//                 </div>
//                 <div class="d-flex justify-content-between">
//                     <div class="flex-start pt-4">
//                         ${phone_number_html}
//                     </div>
//                     <div class="flex-end  pt-4">
//                             ${time_table_html}
//                     </div>
//                 </div>
//             </div><hr>
//                     `;
//           })
//           .join("");

//         console.log(html);
//         document.getElementById("locations_" + key).innerHTML = html;
//       }
//     }
//   });
var osm = "http://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png",
  map1 = L.map("map1", { sleep: false })
    .setView([47.9135779, 106.891201], 18)
    .addLayer(L.tileLayer(osm));
var gl = L.mapboxGL({
  style:
    "https://api.maptiler.com/maps/6afd3992-cc29-48c7-b0cd-8cb2bc6826f9/style.json?key=ivor5C9n3yQrz3CjJORd",
}).addTo(map1);
const markerIcon = L.icon({
  iconUrl: `https://api.geoapify.com/v1/icon?size=xx-large&type=awesome&color=%2315886A&icon=map-marker-alt&apiKey=${`279a1906fe04474cab20406de93c2d11`}`,
  iconSize: [31, 46],
  iconAnchor: [15.5, 42],
  popupAnchor: [0, -45],
});

function initMap() {
  var locations = [
    // ['UBH Center', 47.9174393, 106.9218193, '94111192'],
    // ['Ундрам Од Нотариат', 47.9223606, 106.8697753, '99033617'],
    // ['11-р хороолол СБД-ийн ЗДТГын хажууд', 47.926705, 106.930293, '99083828'],
    ["Гранд Плаза", 47.914, 106.890801, "75111133"],
    // ['25-р Эмийн Сан (Нотариат)', 47.914366, 106.879735, '99192045'],
    // ['Төв номын сан (нотариат)', 47.914061, 106.915090, '99033617'],
    // ['Цэцээ гүн (Нотариат)', 47.922294, 106.915674, '99082652'],
    // ['19-ийн үйлчилгээний төв 10р байр', 47.901784, 106.900909, '91913705'],
    // ['32-н буудал Төрийн банктай байр', 47.911599, 106.832922, '99008529'],
    // ['City Tower', 47.919267, 106.920730, '89113425'],
    // ['БГД 2-р хороо', 47.914275, 106.886171, '99135992'],
    // ['Эрдэнэт', 49.0564917, 104.0160386, '9900-8675'],
    // ['10-р хороолол EFES дэлгүүрийн хажууд', 47.914324, 106.8729699, '90092611'],
    // ['Бөхийн өргөө Golden pen бичиг хэрэг дэлгүүрийн зүүн талд', 47.9183005, 106.936134, '99833873'],
    // ['Сүхбаатар дүүрэг, 8-р хороо, СТӨргөө Г корпус 1 давхар 12 тоот', 47.9195764, 106.9171132, '99105900'],
    // ['Дархан', 49.4707087, 105.9615297, '99770744'],
    // ['Өмнөговь Ханбогд сум Иргэдийн хөгжлийн төв 1 давхар', 43.1967623, 107.1994426, '88100927'],
    // ['Өмнөговь Даланзадгад сум Royal center 202тоот', 43.5789658, 104.4196217, '99436604'],
    // ['Увс Улаангом, 3р баг, Халиун -Бургаа-н дэлгүүр', 49.9903557, 92.0620124, '99455959'],
    // ['Сүхбаатар Баруун урт, 7-р баг Одкон хотхон "Цахим Баавгай" ХХК', 46.6756472, 113.2795101, '91012822'],
    // ['Хөвсгөл Мөрөн, 5-р баг, Цагаан-Уул зах', 49.6343025, 100.1570713, '99999538'],
    // ['Завхан', 47.7337814, 96.8433988, '99106621'],
    // ['Булган', 48.2969521, 103.4335435, '95839407'],
    // ['Өвөрхангай', 46.2602463, 102.7818653, '88232003'],
  ];
  for (var i in locations) {
    const zooMarker = L.marker([locations[i][1], locations[i][2]], {
      icon: markerIcon,
    })
      .bindPopup(
        '<h5 class="trigger"> ' +
          locations[i][0] +
          "<br/>  <small> Утас: " +
          locations[i][3] +
          "</small></h5>"
      )
      .addTo(map1);
  }
}
initMap();
